#1
r = int(input('Введите радиус круга:\n'))
pi = 3.14159
s = r*r*pi
print(f'Площадь круга равна {s}\n')

#2
a = int(input('Введите коэффициент a:\n'))
b = int(input('Введите коэффициент b:\n'))
if a==0 and b!=0:
    print('Решений нет\n')
elif a==0 and b==0:
    print('Решений бесконечно много\n')
else:
    print(f'x равно {-b/a}\n')

#3
cel = int(input('Введите температуру в градусах по Цельсию:\n'))
far = 95*cel + 32
print(f'Температура в градусах по Фаренгейту: {far}\n')

#4
a = int(input('Введите первое число:\n'))
b = int(input('Введите второе число:\n'))
c = int(input('Введите третье число:\n'))
avg = (a+b+c)/3
print(f'Среднее арифметическое равно {avg}\n')

#5
ex1 = 5 + 2 * 3 - 4 / 2 #9
ex2 = (3 + 5) * (2 + 4) / 2 #24
ex3 = -3 + 6 / 2 * 4 #9
ex4 = 5 + 4 * 5**2 + 7 #112
print(f'Первый пример: {ex1}')
print(f'Второй пример: {ex2}')
print(f'Третий пример: {ex3}')
print(f'Четвертый пример: {ex4}')